
Процедура ОбработкаПроведения(Отказ, Режим)
	
	СтруктураУчетнаяПолитика = РегистрыСведений.УчетныеПолитики.ПолучитьПоследнее(Дата);
	Если СтруктураУчетнаяПолитика.УчетнаяПолитика = Перечисления.ВидыУчетнойПолитики.FEFO Тогда
		ОтражатьСрокиГодности = Истина;
	Иначе
		ОтражатьСрокиГодности = Ложь;
	КонецЕсли;
	
		Движения.ТоварыНаСкладах.Записывать = Истина;
		Движения.Хозрасчетный.Записывать = Истина;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПоступлениеТоваровИМатериаловНоменклатура.Товар КАК Товар,
		               |	СУММА(ПоступлениеТоваровИМатериаловНоменклатура.Количество) КАК Количество,
		               |	ПоступлениеТоваровИМатериаловНоменклатура.СрокГодности КАК СрокГодности,
		               |	СУММА(ПоступлениеТоваровИМатериаловНоменклатура.Сумма) КАК Сумма,
		               |	ПоступлениеТоваровИМатериаловНоменклатура.Товар.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета
		               |ИЗ
		               |	Документ.ПоступлениеТоваровИМатериалов.Номенклатура КАК ПоступлениеТоваровИМатериаловНоменклатура
		               |ГДЕ
		               |	ПоступлениеТоваровИМатериаловНоменклатура.Ссылка = &Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПоступлениеТоваровИМатериаловНоменклатура.СрокГодности,
		               |	ПоступлениеТоваровИМатериаловНоменклатура.Товар,
		               |	ПоступлениеТоваровИМатериаловНоменклатура.Товар.СчетБухгалтерскогоУчета";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		
		Пока Выборка.Следующий() Цикл
			Движение = Движения.ТоварыНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Товар;
			Движение.Количество = Выборка.Количество;
			Движение.Склад = Склад;
			Движение.Сумма = Выборка.Сумма;
			Если ОтражатьСрокиГодности Тогда
				Движение.СрокГодности = Выборка.СрокГодности;
			КонецЕсли;
			
			Движение = Движения.Хозрасчетный.Добавить();
			Движение.СчетДт = Выборка.СчетБухгалтерскогоУчета;
			Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
			Движение.Период = Дата;
			Движение.Сумма = Выборка.Сумма;
			Движение.Содержание = "Отражено поступление товарно-материальных ценостей от поставщика";
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура] = Выборка.Товар;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты] = Поставщик;

		КонецЦикла;
		
КонецПроцедуры
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = Номенклатура.Итог("Сумма");
КонецПроцедуры

	
