&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Предмет = Задачи.ЗадачиИсполнителя.ВозвратПредмет(Объект.БизнесПроцесс);
	Объект.Наименование = "Получить согласие клиента " + Объект.Предмет + "на регистрацию";
	Объект.ОписаниеЗадачи = "Из мобильного приложения поступила заявка на регистрацию пользователя.
	| Необходимо созваниться с клиентом " + Объект.Предмет + " по телефону " + Задачи.ЗадачиИсполнителя.ВозвратТелефон(Объект.БизнесПроцесс) + " и получить согласие на регистрацию, а так же дозополнить карточку клиента - ФИО, Дату рождения, сведения о питомцах и другие данные, которые клиент согласен предоставить.";
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКартуМаршрута(Команда)
	
	КартаМаршрута = ОткрытьФорму("БизнесПроцесс.ДорегистрацияПользователя.Форма.КартаМаршрута");
	КартаМаршрута.БизнесПроцесс = Объект.БизнесПроцесс; 
	
КонецПроцедуры
