
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Автор) Тогда	
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;  	
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПерерасчетСуммуДокумента() 
	Объект.СуммаДокумента =  Объект.Номенклатура.Итог("Сумма");  
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Номенклатура.ТекущиеДанные;
	
	РаботаСтабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ); 
	
	ПерерасчетСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураКоличествоПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Номенклатура.ТекущиеДанные;
	
	РаботаСтабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ); 
	
	ПерерасчетСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураТоварПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Номенклатура.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(СтрокаТЧ.Товар) Тогда 
		СтрокаТЧ.Цена = РаботаСЦенамиВызовСервера.ПолучитьЦенуПоставщикаНаДату(СтрокаТЧ.Товар,,Объект.Дата);
	Иначе
		СтрокаТЧ.Цена = 0;
	КонецЕсли;
	
	РаботаСтабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	
	ПерерасчетСуммуДокумента();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦены(Команда)
	
	СтрокаТЧ = Элементы.Номенклатура.ТекущиеДанные;
	
	Для Каждого СтрокаТЧ Из Объект.Номенклатура Цикл
	
	СтрокаТЧ.Цена = РаботаСЦенамиВызовСервера.ПолучитьЦенуПоставщикаНаДату(СтрокаТЧ.Товар,,Объект.Дата);
	
	КонецЦикла;
	
КонецПроцедуры




