
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 УстановитьВидимость();
КонецПроцедуры 
&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагента.Клиент") Тогда
		Элементы.ДатаРожденияКлиента.Видимость = Истина;
		Элементы.Источник.Видимость = Истина;
		Элементы.Договор.Видимость = Ложь;
		Элементы.Питомцы.Видимость = Истина;
		Элементы.Пол.Видимость = Истина;
		Элементы.Наименование.Заголовок = "Ф.И.О клиента";
	Иначе
	    Элементы.ДатаРожденияКлиента.Видимость = Ложь;
		Элементы.Источник.Видимость = Ложь;
		Элементы.Договор.Видимость = Истина;
		Элементы.Питомцы.Видимость = Ложь;
		Элементы.Пол.Видимость = Ложь;
		Элементы.Наименование.Заголовок = "Наименование";
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	 УстановитьВидимость();
КонецПроцедуры

		
