Функция ПроверитьОтветПользователя(БизнесПроцессРегистрации) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("БизнесПроцесс" ,БизнесПроцессРегистрации);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачиИсполнителяЗадачиПоИсполнителю.ПолученоСогласие КАК ПолученоСогласие,
	|	ЗадачиИсполнителяЗадачиПоИсполнителю.Ссылка КАК Ссылка
	|ИЗ
	|	Задача.ЗадачиИсполнителя.ЗадачиПоИсполнителю КАК ЗадачиИсполнителяЗадачиПоИсполнителю
	|ГДЕ
	|	ЗадачиИсполнителяЗадачиПоИсполнителю.БизнесПроцесс = &БизнесПроцесс";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ПолученоСогласие;
	
КонецФункции

Функция ПолучитСсылкуДляКМ(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗадачиИсполнителяЗадачиПоИсполнителю.БизнесПроцесс КАК БизнесПроцесс
	|ИЗ
	|	Задача.ЗадачиИсполнителя.ЗадачиПоИсполнителю КАК ЗадачиИсполнителяЗадачиПоИсполнителю
	|ГДЕ
	|	ЗадачиИсполнителяЗадачиПоИсполнителю.Ссылка = &Ссылка"; 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.БизнесПроцесс;
	
КонецФункции

